In [1]:
import sqlalchemy
from sqlalchemy import create_engine
from sqlalchemy import Table, Column, Integer, String, MetaData, ForeignKey
from sqlalchemy import inspect
import pandas as pd

host = 'localhost'
port = 8080
database = 'default'

engine = create_engine(f'presto://hive@{host}:{port}/hive/default')

In [14]:
print(engine)

Engine(presto://hive@localhost:8080/hive/default)

In [2]:
ddl = """
CREATE TABLE IF NOT EXISTS pokes3 (
foo bigint,
bar varchar
)
COMMENT 'test create table'
"""
with engine.connect() as conn:
    rs = conn.execute(ddl)

In [3]:
df_read = pd.read_sql('SELECT * FROM pokes3', con=engine)
df_read

Empty DataFrame
Columns: [foo, bar]
Index: []

In [4]:
df = pd.read_csv('kv1.csv', delimiter="", names=['foo','bar'])
df

     foo      bar
0    238  val_238
1     86   val_86
2    311  val_311
3     27   val_27
4    165  val_165
..   ...      ...
495  169  val_169
496  403  val_403
497  400  val_400
498  200  val_200
499   97   val_97

[500 rows x 2 columns]

In [ ]:
df.to_sql('pokes3', index=False, con=engine, if_exists="append")

In [29]:
df_read = pd.read_sql('SELECT * FROM pokes', con=engine)
df_read

     foo      bar
0    378  val_378
1     37   val_37
2    377  val_377
3    338  val_338
4    309  val_309
..   ...      ...
494  477  val_477
495  136  val_136
496  200  val_200
497  265  val_265
498  414  val_414

[499 rows x 2 columns]